export default {
  projections: {
    СкладE: {
      номер: {
        __caption__: 'Номер'
      },
      адрес: {
        __caption__: 'Адрес'
      },
      сотрудник: {
        __caption__: 'Сотрудник',
        отчество: {
          __caption__: 'Отчество'
        }
      },
      товарНаСкладе: {
        __caption__: 'Товар на складе',
        количество: {
          __caption__: 'Количество'
        },
        товар: {
          __caption__: 'Товар',
          название: {
            __caption__: 'Название'
          }
        }
      }
    },
    СкладL: {
      номер: {
        __caption__: 'Номер'
      },
      адрес: {
        __caption__: 'Адрес'
      },
      сотрудник: {
        __caption__: 'Отчество',
        отчество: {
          __caption__: 'Отчество'
        }
      }
    }
  },
  validations: {
    адрес: {
      __caption__: 'Адрес'
    },
    номер: {
      __caption__: 'Номер'
    },
    сотрудник: {
      __caption__: 'Сотрудник'
    },
    товарНаСкладе: {
      __caption__: 'Товар на складе'
    }
  }
};
